# macOS packages — install with: brew bundle --file=mac/Brewfile

# ── Formulae (CLI tools) ──────────────────────────────────────────────────────

# Shell & core
brew "fish"
brew "starship"
brew "git"
brew "gh"
brew "glab"
brew "wget"
brew "fnm"

# Dev tools
brew "deno"
brew "gradle"
brew "python"
brew "ruby"
brew "git-lfs"
brew "git-filter-repo"
brew "cocoapods"

# Rust — after install, run: rustup default stable && rustup component add clippy rust-analyzer
brew "rustup"

# React Native
# bun — install via: curl -fsSL https://bun.sh/install | bash
brew "watchman"

# Cloud
brew "awscli"
brew "cloudflared"

# Media
brew "mpv"
brew "tesseract"

# CLI utilities
brew "aria2"
brew "btop"
brew "cloc"
brew "fzf"
brew "htop"
brew "jq"
brew "lazygit"
brew "rename"
brew "tectonic"
brew "tmux"

# ── Casks (GUI apps) ──────────────────────────────────────────────────────────

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-sans"
cask "font-noto-color-emoji"

# Browsers
cask "brave-browser"
cask "zen"

# Chat & social
cask "discord"
cask "spotify"
cask "telegram"

# Dev tools
cask "android-studio"
cask "android-platform-tools"
cask "docker-desktop"
cask "github"
cask "visual-studio-code"

# AI
cask "claude"
cask "codex"
# Claude Code CLI — installed by setup.sh via: curl -fsSL https://claude.ai/install.sh | bash

# Cloud
cask "gcloud-cli"

# Productivity
cask "alt-tab"
cask "ghostty"
cask "karabiner-elements"
cask "raycast"

# Media
cask "eqmac"
cask "iina"
cask "kdenlive"
cask "lastfm"
cask "obs"

# VPN & networking
cask "ngrok"
cask "protonvpn"
cask "windscribe"

# Apps
cask "au-lab"
cask "bitwarden"
cask "obsidian"
cask "postman"
cask "qbittorrent"
